61968-6/target/epri-61968-6/WEB-INF/classes/resources/wsdl/get/GetMaintenanceOrders.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:tns="http://iec.ch/TC57/2015/GetMaintenanceOrders" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsi="http://ws-i.org/schemas/conformanceClaim/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:infoMessage="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" xmlns:ns="http://iec.ch/TC57/2011/schema/message" xmlns:ns1="http://iec.ch/TC57/2015/GetMaintenanceOrders#" xmlns:ns2="http://iec.ch/TC57/2015/MaintenanceOrders#" name="GetMaintenanceOrders" targetNamespace="http://iec.ch/TC57/2015/GetMaintenanceOrders">
	<wsdl:types>
		<xs:schema targetNamespace="http://iec.ch/TC57/2015/GetMaintenanceOrders" elementFormDefault="qualified">
			<xs:import namespace="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" schemaLocation="xsd/GetMaintenanceOrdersMessage.xsd"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="GetMaintenanceOrdersRequestMessage">
		<wsdl:part name="GetMaintenanceOrdersRequestMessage" element="infoMessage:GetMaintenanceOrdersRequestMessage"/>
	</wsdl:message>
	<wsdl:message name="GetMaintenanceOrdersResponseMessage">
		<wsdl:part name="GetMaintenanceOrdersResponseMessage" element="infoMessage:GetMaintenanceOrdersResponseMessage"/>
	</wsdl:message>
	<wsdl:message name="GetMaintenanceOrdersFaultMessage">
		<wsdl:part name="GetMaintenanceOrdersFaultMessage" element="infoMessage:GetMaintenanceOrdersFaultMessage"/>
	</wsdl:message>
	<wsdl:portType name="GetMaintenanceOrders_Port">
		<wsdl:operation name="GetMaintenanceOrders">
			<wsdl:input name="GetMaintenanceOrdersRequest" message="tns:GetMaintenanceOrdersRequestMessage"/>
			<wsdl:output name="GetMaintenanceOrdersResponse" message="tns:GetMaintenanceOrdersResponseMessage"/>
			<wsdl:fault name="GetMaintenanceOrdersFault" message="tns:GetMaintenanceOrdersFaultMessage"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="GetMaintenanceOrders_Binding" type="tns:GetMaintenanceOrders_Port">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="GetMaintenanceOrders">
			<soap:operation soapAction="http://iec.ch/TC57/2015/GetMaintenanceOrders/GetMaintenanceOrders" style="document"/>
			<wsdl:input name="GetMaintenanceOrdersRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="GetMaintenanceOrdersResponse">
				<soap:body use="literal"/>
			</wsdl:output>
			<wsdl:fault name="GetMaintenanceOrdersFault">
				<soap:fault name="GetMaintenanceOrdersFault" use="literal"/>
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="GetMaintenanceOrders">
		<wsdl:port name="GetMaintenanceOrders_Port" binding="tns:GetMaintenanceOrders_Binding">
			<soap:address location="http://iec.ch/TC57/2015/GetMaintenanceOrders"/>
		</wsdl:port>
	</wsdl:service>
	<xs:schema targetNamespace="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" elementFormDefault="qualified">
		<xs:import namespace="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" schemaLocation="xsd/GetMaintenanceOrdersMessage.xsd"/>
		<!--<xs:include schemaLocation="xsd/GetyMaintenanceOrdersMessage.xsd"/>-->
	</xs:schema>



	<!-- Message Definitions -->
	<!-- Port Definitions -->
</wsdl:definitions>
